In [2]:
import sys
print('python', sys.version)

import numpy as np
print('numpy', np.__version__)

import pandas as pd
print('pandas', pd.__version__)

# 결과 확인을 용이하게 하기 위한 코드
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

python 3.9.7 (default, Sep 16 2021, 16:59:28) [MSC v.1916 64 bit (AMD64)]
numpy 1.20.3
pandas 1.4.1

## series 간 function

### index 공유하는 경우

In [2]:
print("## index 동일")
sr1=pd.Series(data=[1,2,3,4,5], index=list('abcde'))
sr2=pd.Series(data=[5,2,4,3,1], index=list('abcde'))
sr1
sr2
sr1*sr2
sr1>sr2

print("## index 다름 (순서만)")
sr1=pd.Series(data=[1,2,3,4,5], index=list('abcde'))
sr2=pd.Series(data=[5,2,4,3,1], index=list('daecb'))
sr1
sr2
sr1+sr2
sr1>sr2

## index 동일

a    1
b    2
c    3
d    4
e    5
dtype: int64

a    5
b    2
c    4
d    3
e    1
dtype: int64

a     5
b     4
c    12
d    12
e     5
dtype: int64

a    False
b    False
c    False
d     True
e     True
dtype: bool

## index 다름 (순서만)

a    1
b    2
c    3
d    4
e    5
dtype: int64

d    5
a    2
e    4
c    3
b    1
dtype: int64

a    3
b    3
c    6
d    9
e    9
dtype: int64

ValueError: Can only compare identically-labeled Series objects

### index 공유하지 않는 경우 & np.nan 처리

In [9]:
sr1=pd.Series(data=[3,2,1,4,5], index=list('cdbef'), name='sr1')
sr2=pd.Series(data=[3,2,1,4,5], index=list('abcde'), name='sr2')
sr3=sr1+sr2
sr3
sr3.isnull()
sr3.notnull()
np.sum(sr3.isnull())
sr3.loc[sr3.notnull()]
sr1>sr2

a    NaN
b    3.0
c    4.0
d    6.0
e    9.0
f    NaN
dtype: float64

a     True
b    False
c    False
d    False
e    False
f     True
dtype: bool

a    False
b     True
c     True
d     True
e     True
f    False
dtype: bool

2

b    3.0
c    4.0
d    6.0
e    9.0
dtype: float64

ValueError: Can only compare identically-labeled Series objects

## Series 수학함수

In [41]:
sr1=pd.Series(data=[1,2,3,4,5], index=list('abcde'), name='sr1')
sr1
np.exp(sr1)
np.power(sr1,2)

a    1
b    2
c    3
d    4
e    5
Name: sr1, dtype: int64

a      2.718282
b      7.389056
c     20.085537
d     54.598150
e    148.413159
Name: sr1, dtype: float64

a     1
b     4
c     9
d    16
e    25
Name: sr1, dtype: int64

## 실습

### 실습1

In [12]:
sr1=pd.Series(np.random.randint(10,size=10))
sr1
sr2=sr1*3+1
sr2
sr3=sr2.loc[sr2%5==0]
sr3
ar1=np.array(sr3.index)
ar1.sum()
np.sum(sr3.index) # 위와 같은 코드

0    6
1    9
2    3
3    7
4    6
5    4
6    5
7    6
8    3
9    4
dtype: int32

0    19
1    28
2    10
3    22
4    19
5    13
6    16
7    19
8    10
9    13
dtype: int32

2    10
8    10
dtype: int32

10

10

### 실습2

In [13]:
sr1=pd.Series(np.random.randint(100,size=6), index=list('abcdef'))
sr1
sr1=sr1.sort_values(ascending=False)
sr1
sr1.index
sr1.index[1]

a     1
b    10
c    39
d    57
e    63
f    47
dtype: int32

e    63
d    57
f    47
c    39
b    10
a     1
dtype: int32

Index(['e', 'd', 'f', 'c', 'b', 'a'], dtype='object')

'd'

### 실습3

In [15]:
## 1)
s1=pd.Series(np.random.randint(10,size=5), index=np.random.choice(list('abcdefgh'), size=5, replace=False))
s1
s2=pd.Series(np.random.randint(10,size=5), index=np.random.choice(list('abcdefgh'), size=5, replace=False))
s2
s3=pd.Series(np.random.randint(10,size=5), index=np.random.choice(list('abcdefgh'), size=5, replace=False))
s3

## 2)
s4=s1+s2+s3
s4
s4.sum()
s5=s4[s4.notnull()]
s5.sum()

h    8
c    8
e    5
a    4
d    1
dtype: int32

d    9
e    1
a    2
f    0
c    0
dtype: int32

h    9
d    9
f    3
e    8
c    5
dtype: int32

a     NaN
c    13.0
d    19.0
e    14.0
f     NaN
h     NaN
dtype: float64

46.0

46.0

## DataFrame 객체 생성하기1 (필요 정보 따로 입력)

### 연습

In [3]:
## dtypes float로 모두 적용
dat=np.arange(12).reshape(3,4)
df1=pd.DataFrame(data=dat, index=[1,2,3], columns=list('abcd'), dtype=float)
df1
df1.dtypes

     a    b     c     d
1  0.0  1.0   2.0   3.0
2  4.0  5.0   6.0   7.0
3  8.0  9.0  10.0  11.0

a    float64
b    float64
c    float64
d    float64
dtype: object

In [4]:
## dtypes float로 모두 적용
dat=[[1,2,3,4],['a',6,7,8],[9,10,'11',12]]
df1=pd.DataFrame(data=dat, index=[1,2,3], columns=list('abcd'), dtype=float)
df1
df1.dtypes

C:\Users\jjmsk\AppData\Local\Temp\ipykernel_23916\37964554.py:3: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df1=pd.DataFrame(data=dat, index=[1,2,3], columns=list('abcd'), dtype=float)

   a     b     c     d
1  1   2.0   3.0   4.0
2  a   6.0   7.0   8.0
3  9  10.0  11.0  12.0

a     object
b    float64
c    float64
d    float64
dtype: object

## DataFrame 객체 생성하기2 (사전 활용)

### 연습

In [8]:
dic1={'a':[1,2,3],'b':[2,3,7],'c':[3,4,10]}
## index 입력 안할 경우
df1=pd.DataFrame(dic1)
df1
## index 입력 할 경우
df1=pd.DataFrame(dic1, index=['g','k','p'])
df1

   a  b   c
0  1  2   3
1  2  3   4
2  3  7  10

   a  b   c
g  1  2   3
k  2  3   4
p  3  7  10

In [7]:
## data만 입력시 dataframe 생성
df1=pd.DataFrame(np.arange(12).reshape(3,4))
df1

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

## DataFrame 객체 생성하기3 (nested 사전 활용)

### 연습

In [10]:
## index 통일
dic1={'a':{'d':1,'e':2},'b':{'d':10,'e':20},'c':{'d':100,'e':200}}

df1=pd.DataFrame(dic1)
df1

## index 통일 X
dic1={'a':{'d':1,'e':2},'b':{'d':10,'f':20},'c':{'d':100,'e':200}}

df1=pd.DataFrame(dic1)
df1

   a   b    c
d  1  10  100
e  2  20  200

     a     b      c
d  1.0  10.0  100.0
e  2.0   NaN  200.0
f  NaN  20.0    NaN

## DataFrame 객체 생성하기4 (파일로부터 읽기)

### 다양한 parameter 사용

In [16]:
## 기본 사용 방법
df1=pd.read_table('pandas_data1.txt', sep='\t', encoding='cp949')
df1.dtypes
df1.head()
df1.tail()

## header=None
df1=pd.read_table('pandas_data1.txt', header=None, sep='\t', encoding='cp949')
df1.head()

## index 지정
df1=pd.read_table('pandas_data1.txt', index_col='이름',sep='\t', encoding='cp949') 
df1.head()

## 사용할 column 지정
df1=pd.read_table('pandas_data1.txt',  index_col='이름', usecols=['이름','출석','과제'],sep='\t', encoding='cp949')
df1.head()

이름    object
성별    object
학년     int64
중간     int64
기말     int64
출석     int64
과제     int64
dtype: object

    이름  성별  학년  중간  기말  출석  과제
0   김둘  여자   1  17  36   5  75
1   김셋  남자   2  17  20   5  96
2  김여섯  남자   2  28  20   4  83
3  김일곱  남자   2  20  44   6  82
4  김여덜  여자   1  20  24   8  88

     이름  성별  학년  중간  기말  출석  과제
25  김다섯  남자   2  24  18   6  84
26  이하나  남자   3  29  17   5  79
27   이둘  남자   4  30  42   8  98
28   이셋  남자   4  22  50   4  79
29   이넷  여자   4  24  21  10  89

     0   1   2   3   4   5   6
0   이름  성별  학년  중간  기말  출석  과제
1   김둘  여자   1  17  36   5  75
2   김셋  남자   2  17  20   5  96
3  김여섯  남자   2  28  20   4  83
4  김일곱  남자   2  20  44   6  82

     성별  학년  중간  기말  출석  과제
이름
김둘   여자   1  17  36   5  75
김셋   남자   2  17  20   5  96
김여섯  남자   2  28  20   4  83
김일곱  남자   2  20  44   6  82
김여덜  여자   1  20  24   8  88

     출석  과제
이름
김둘    5  75
김셋    5  96
김여섯   4  83
김일곱   6  82
김여덜   8  88

### parameter index_col 사용

In [20]:
## index 지정
df1=pd.read_table('pandas_data2.txt', index_col='num',sep='\t', encoding='cp949') 
df1

df1=pd.read_table('pandas_data2.txt', index_col='2',sep='\t', encoding='cp949') 
df1

df1=pd.read_table('pandas_data2.txt', index_col=2,sep='\t', encoding='cp949') 
df1

      4   1   3   2   5
num
a    99  98  24   9  73
b    36   6  21  79  82
c    44  49  39  54  13
d    53  94  44  81  35

   num   4   1   3   5
2
9    a  99  98  24  73
79   b  36   6  21  82
54   c  44  49  39  13
81   d  53  94  44  35

   num   4   3   2   5
1
98   a  99  24   9  73
6    b  36  21  79  82
49   c  44  39  54  13
94   d  53  44  81  35

### missing value --> np.nan

In [5]:
df1=pd.read_table('pandas_data3.txt',sep='\t', encoding='cp949') 
df1.head()
df1.dtypes
df1.loc[4,'성별']
df1.loc[4,'성별']==df1.loc[4,'성별']

    이름   성별   학년    중간  기말  출석  과제
0   김둘   여자  1.0   NaN  36   5  75
1   김셋   남자  2.0  17.0  20   5  96
2  김여섯   남자  2.0  28.0  20   4  83
3  김일곱   남자  NaN  20.0  44   6  82
4  김여덜  NaN  1.0  20.0  24   8  88

이름     object
성별     object
학년    float64
중간    float64
기말      int64
출석      int64
과제      int64
dtype: object

nan

False

## 실습4

In [24]:
# 방법1
dat=[['aa','suwon',2],['bb','suwon',1],['cc','aju',3]]
d1=pd.DataFrame(data=dat, index=['st1','st2','st3'], columns=['name','univ','rank'])
d1.dtypes
d1
# 방법2
dat={'name':['aa','bb','cc'],'univ':['suwon','suwon','aju'], 'rank':[2,1,3]}
d2=pd.DataFrame(data=dat, index=['st1','st2','st3'])
d2
# 방법4
d3=pd.read_table('prac1.txt', index_col=0, sep='\t')
d3
d3=pd.read_table('prac1.txt', sep='\t')
d3

name    object
univ    object
rank     int64
dtype: object

    name   univ  rank
st1   aa  suwon     2
st2   bb  suwon     1
st3   cc    aju     3

    name   univ  rank
st1   aa  suwon     2
st2   bb  suwon     1
st3   cc    aju     3

    name   univ  rank
st1   aa  suwon     2
st2   bb  suwon     1
st3   cc    aju     3

  Unnamed: 0 name   univ  rank
0        st1   aa  suwon     2
1        st2   bb  suwon     1
2        st3   cc    aju     3

## dataframe 각 요소 확인 및 변경하기

In [2]:
## 각 요소 확인
dic1={'a':[1,2,3],'b':[2,3,4], 'c':[3,4,5]}
df1=pd.DataFrame(data=dic1, index=list('gkp'))
df1
df1.index
print(df1.index.name)
df1.columns
print(df1.columns.name)
df1.dtypes
df1.values
type(df1.values)

   a  b  c
g  1  2  3
k  2  3  4
p  3  4  5

Index(['g', 'k', 'p'], dtype='object')

None

Index(['a', 'b', 'c'], dtype='object')

None

a    int64
b    int64
c    int64
dtype: object

array([[1, 2, 3],
       [2, 3, 4],
       [3, 4, 5]], dtype=int64)

numpy.ndarray

In [3]:
## 각 요소 변경
dic1={'a':[1,2,3],'b':[2,3,4], 'c':[3,4,5]}
df1=pd.DataFrame(data=dic1, index=list('gkp'))
df1
df1.index=[1,2,3]
df1.index.name='inds'
df1.columns=list('uio')
df1.columns.name='cols'
df1=df1.astype(float)
df1
df1['u']=df1['u'].astype(int)
df1
df1['i']=[10,20,30] # 원래 있는 column i 값 변경
df1['j']=[100,200,300] # 새로운 column j 추가
df1

   a  b  c
g  1  2  3
k  2  3  4
p  3  4  5

cols    u    i    o
inds
1     1.0  2.0  3.0
2     2.0  3.0  4.0
3     3.0  4.0  5.0

cols  u    i    o
inds
1     1  2.0  3.0
2     2  3.0  4.0
3     3  4.0  5.0

cols  u   i    o    j
inds
1     1  10  3.0  100
2     2  20  4.0  200
3     3  30  5.0  300

## dataframe dtype의 중요성

In [4]:
dic1={'a':[1,2,3],'b':[2,3,4], 'c':[3,4,5]}
df1=pd.DataFrame(data=dic1, index=list('gkp'))
df1
df1.mean(axis=0)
df1['c']=df1['c'].astype(str)
df1
df1.mean(axis=0)

   a  b  c
g  1  2  3
k  2  3  4
p  3  4  5

a    2.0
b    3.0
c    4.0
dtype: float64

   a  b  c
g  1  2  3
k  2  3  4
p  3  4  5

a      2.0
b      3.0
c    115.0
dtype: float64

In [4]:
# 'pandas_data4.txt' <= 이열의 출석점수 9a로 수정
df1=pd.read_table('pandas_data4.txt', sep='\t', encoding='cp949')
df1
df1.dtypes
df1['출석'].iloc[:5].sum()

     이름  성별  학년  중간  기말  출석   과제
0    김둘  여자   1  17  36   5   75
1    김셋  남자   2  17  20   5   96
2   김여섯  남자   2  28  20   4   83
3   김일곱  남자   2  20  44   6   82
4   김여덜  남자   1  20  24   8   88
5   김아홉  남자   3  23  45  10   92
6    김열  남자   3  16  47   5   83
7   이다섯  남자   3  21  35   5   92
8   이아홉  남자   3  20  36   5   87
9    이열  여자   4  28  41  9a   87
10  박하나  남자   4  30  25   7   86
11   박둘  남자   4  20  31   7   76
12  박여섯  여자   1  24  37   7   91
13  김하나  여자   2  19  18   8   88
14   박열  남자   3  23  20   6   80
15  최하나  여자   1  29  39   5   83
16   최둘  남자   1  18  29   5   86
17   최셋  남자   2  29  39   7   84
18  이여섯  여자   3  22  38   7   78
19  이일곱  남자   3  24  32   8   87
20  이여덜  여자   4  17  47   5   70
21  최여덜  남자   4  13  48   8   89
22  최아홉  남자   1  21  33   3  100
23   최열  여자   2  16  50  10  100
24   김넷  남자   1  18  28   7   93
25  김다섯  남자   2  24  18   6   84
26  이하나  남자   3  29  17   5   79
27   이둘  남자   4  30  42   8   98
28   이셋  남자   4  22  50   4   79
29   이넷  여자   4  24  21  10   89

이름    object
성별    object
학년     int64
중간     int64
기말     int64
출석    object
과제     int64
dtype: object

'55468'